{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dtype": "float32", "mask_zero": false, "input_dim": 3002, "name": "embedding_1", "output_dim": 100, "input_length": 65, "batch_input_shape": [null, 65], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null}}, {"class_name": "LSTM", "config": {"go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "recurrent_dropout": 0.1, "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "implementation": 1, "stateful": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "unroll": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "softmax", "bias_constraint": null}}]}